[
    {
        "desc": "Whether to suppress configuration warnings produced by the built-in parameter validation for the HDFS Client Environment Advanced Configuration Snippet (Safety Valve) for hadoop-env.sh parameter.",
        "display_name": "Suppress Parameter Validation: HDFS Client Environment Advanced Configuration Snippet (Safety Valve) for hadoop-env.sh",
        "name": "role_config_suppression_hdfs_client_env_safety_valve",
        "value": "false"
    },
    {
        "desc": "Whether to suppress configuration warnings produced by the built-in parameter validation for the Deploy Directory parameter.",
        "display_name": "Suppress Parameter Validation: Deploy Directory",
        "name": "role_config_suppression_client_config_root_dir",
        "value": "false"
    },
    {
        "desc": "Whether to suppress configuration warnings produced by the built-in parameter validation for the Client Java Configuration Options parameter.",
        "display_name": "Suppress Parameter Validation: Client Java Configuration Options",
        "name": "role_config_suppression_hbase_client_java_opts",
        "value": "false"
    },
    {
        "desc": "For advanced use only, key-value pairs (one on each line) to be inserted into the client configuration for <strong>hadoop-env.sh</strong>",
        "display_name": "HDFS Client Environment Advanced Configuration Snippet (Safety Valve) for hadoop-env.sh",
        "name": "hdfs_client_env_safety_valve",
        "value": null
    },
    {
        "desc": "The directory where the client configs will be deployed",
        "display_name": "Deploy Directory",
        "name": "client_config_root_dir",
        "value": "/etc/hadoop"
    },
    {
        "desc": "For advanced use only, a string to be inserted into <strong>log4j.properties</strong> for this role only.",
        "display_name": "Gateway Logging Advanced Configuration Snippet (Safety Valve)",
        "name": "log4j_safety_valve",
        "value": null
    },
    {
        "desc": "Whether to suppress configuration warnings produced by the HDFS Trash Enabled Validator configuration validator.",
        "display_name": "Suppress Configuration Validator: HDFS Trash Enabled Validator",
        "name": "role_config_suppression_hdfs_trash_disabled_validator",
        "value": "false"
    },
    {
        "desc": "For advanced use only, a string to be inserted into the client configuration for <strong>hdfs-site.xml</strong>.",
        "display_name": "HDFS Client Advanced Configuration Snippet (Safety Valve) for hdfs-site.xml",
        "name": "hdfs_client_config_safety_valve",
        "value": null
    },
    {
        "desc": "The priority level that the client configuration will have in the Alternatives system on the hosts. Higher priority levels will cause Alternatives to prefer this configuration over any others.",
        "display_name": "Alternatives Priority",
        "name": "client_config_priority",
        "value": "90"
    },
    {
        "desc": "Enable HDFS short-circuit read. This allows a client colocated with the DataNode to read HDFS file blocks directly. This gives a performance boost to distributed clients that are aware of locality.",
        "display_name": "Enable HDFS Short-Circuit Read",
        "name": "dfs_client_read_shortcircuit",
        "value": "false"
    },
    {
        "desc": "Maximum size in bytes for the Java process heap memory.  Passed to Java -Xmx.",
        "display_name": "Client Java Heap Size in Bytes",
        "name": "hdfs_client_java_heapsize",
        "value": "268435456"
    },
    {
        "desc": "When set, Cloudera Manager will send alerts when this entity's configuration changes.",
        "display_name": "Enable Configuration Change Alerts",
        "name": "enable_config_alerts",
        "value": "false"
    },
    {
        "desc": "Whether HDFS clients will use the legacy block reader.",
        "display_name": "Use Legacy Blockreader",
        "name": "dfs_client_use_legacy_blockreader",
        "value": "false"
    },
    {
        "desc": "Whether to suppress configuration warnings produced by the built-in parameter validation for the Gateway Logging Advanced Configuration Snippet (Safety Valve) parameter.",
        "display_name": "Suppress Parameter Validation: Gateway Logging Advanced Configuration Snippet (Safety Valve)",
        "name": "role_config_suppression_log4j_safety_valve",
        "value": "false"
    },
    {
        "desc": "Whether to suppress configuration warnings produced by the built-in parameter validation for the HDFS Client Advanced Configuration Snippet (Safety Valve) for hdfs-site.xml parameter.",
        "display_name": "Suppress Parameter Validation: HDFS Client Advanced Configuration Snippet (Safety Valve) for hdfs-site.xml",
        "name": "role_config_suppression_hdfs_client_config_safety_valve",
        "value": "false"
    },
    {
        "desc": "Whether to suppress configuration warnings produced by the CDH Version Validator configuration validator.",
        "display_name": "Suppress Configuration Validator: CDH Version Validator",
        "name": "role_config_suppression_cdh_version_validator",
        "value": "false"
    },
    {
        "desc": "These are Java command line arguments. Commonly, garbage collection flags or extra debugging flags would be passed here.",
        "display_name": "Client Java Configuration Options",
        "name": "hbase_client_java_opts",
        "value": "-Djava.net.preferIPv4Stack=true"
    },
    {
        "desc": "Move deleted files to the trash so that they can be recovered if necessary. This client side configuration takes effect only if the HDFS service-wide trash is disabled (NameNode Filesystem Trash Interval set to 0) and is ignored otherwise. The trash is not automatically emptied when enabled with this configuration.",
        "display_name": "Use Trash",
        "name": "dfs_client_use_trash",
        "value": "false"
    },
    {
        "desc": "The minimum log level for Gateway logs",
        "display_name": "Gateway Logging Threshold",
        "name": "log_threshold",
        "value": "INFO"
    }
]