[
    {
        "desc": "For advanced use only, a string to be inserted into the client configuration for <strong>hdfs-site.xml</strong>.",
        "display_name": "HDFS Client Advanced Configuration Snippet (Safety Valve) for hdfs-site.xml",
        "name": "hdfs_client_config_safety_valve",
        "value": null
    },
    {
        "desc": "For advanced use only, key-value pairs (one on each line) to be inserted into the client configuration for <strong>hadoop-env.sh</strong>.",
        "display_name": "HDFS Client Environment Advanced Configuration Snippet for hadoop-env.sh (Safety Valve)",
        "name": "hdfs_client_env_safety_valve",
        "value": null
    },
    {
        "desc": "The priority level that the client configuration will have in the Alternatives system on the hosts. Higher priority levels will cause Alternatives to prefer this configuration over any others.",
        "display_name": "Alternatives Priority",
        "name": "client_config_priority",
        "value": "90"
    },
    {
        "desc": "When set, Cloudera Manager will send alerts when this entity's configuration changes.",
        "display_name": "Enable Configuration Change Alerts",
        "name": "enable_config_alerts",
        "value": "false"
    },
    {
        "desc": "Maximum size for the Java process heap memory.  Passed to Java -Xmx.  Measured in bytes.",
        "display_name": "Client Java Heap Size in Bytes",
        "name": "hdfs_client_java_heapsize",
        "value": "268435456"
    },
    {
        "desc": "Enable HDFS short circuit read. This allows a client co-located with the DataNode to read HDFS file blocks directly. This gives a performance boost to distributed clients that are aware of locality.",
        "display_name": "Enable HDFS Short Circuit Read",
        "name": "dfs_client_read_shortcircuit",
        "value": "false"
    },
    {
        "desc": "These are Java command line arguments. Commonly, garbage collection flags or extra debugging flags would be passed here.",
        "display_name": "Client Java Configuration Options",
        "name": "hbase_client_java_opts",
        "value": "-Djava.net.preferIPv4Stack=true"
    },
    {
        "desc": "Move deleted files to the trash so that they can be recovered if necessary. This client side configuration takes effect only if the HDFS service-wide trash is disabled (NameNode Filesystem Trash Interval set to 0) and is ignored otherwise. The trash is not automatically emptied when enabled with this configuration.",
        "display_name": "Use Trash",
        "name": "dfs_client_use_trash",
        "value": "false"
    }
]