Repository: openstack-archive/sahara
Catalog: savanna/locale/*/LC_MESSAGES/savanna.po
Languages: fr, pt_br

source: Eventlet backdoor listening on %(port)s for process %(pid)d
fr: Eventlet backdoor en écoute sur le port %(port)s for process %(pid)d
pt_br: Backdoor de Eventlet escutando na porta %(port)s pelo processo %(pid)d

source: Uncaught exception
fr: Exception non interceptée
pt_br: Exceção não capturada

source: Original exception being dropped: %s
fr: Exception d'origine en cours de suppression : %s
pt_br: Exceção original sendo descartada: %s

source: Unexpected exception occurred %d time(s)... retrying.
fr: Exception inattendue survenue %d fois... Nouvel essai.
pt_br: Exceção não esperada ocorreu %d vez(es)... tentando novamente.

source: Reloading cached file %s
fr: Rechargement du fichier mis en mémoire cache %s
pt_br: Recarregando arquivo em cache %s

source: Could not release the acquired lock `%s`
fr: Impossible de relâcher le verrou acquis `%s`
pt_br: Não foi possível liberar o lock adquirido "%s"

source: Got semaphore "%(lock)s"
fr: Sémaphore "%(lock)s" obtenu
pt_br: Recebeu semáforo "%(lock)s"

source: Attempting to grab file lock "%(lock)s"
fr: Tentative d'appropriation du fichier verrouillé "%(lock)s"
pt_br: Tentando capturar lock de arquivo "%(lock)s"

source: Created lock path: %s
fr: Chemin de verrou créé: %s
pt_br: Criado caminho de lock: %s

source: Got file lock "%(lock)s" at %(path)s
fr: Verrou de fichier "%(lock)s" obtenu au niveau de %(path)s
pt_br: Obteve lock do arquivo "%(lock)s" em %(path)s

source: Released file lock "%(lock)s" at %(path)s
fr: Verrou de fichier "%(lock)s" libéré au niveau de %(path)s
pt_br: Liberado lock de arquivo "%(lock)s" em %(path)s

source: Got semaphore / lock "%(function)s"
fr: Sémaphore / verrou "%(function)s" obtenu
pt_br: Recebeu semáforo / lock "%(function)s"

source: Semaphore / lock released "%(function)s"
fr: Sémaphore / verrou "%(function)s" libéré
pt_br: Liberado semáforo / lock "%(function)s"

source: Deprecated: %s
fr: Obsolète: %s
pt_br: Deprecado: %s

source: Error loading logging config %(log_config)s: %(err_msg)s
fr: Erreur lors du chargement de la configuration de connexion %(log_config)s: %(err_msg)s
pt_br: Erro carregando configuração de logging: %(log_config)s: %(err_msg)s

source: syslog facility must be one of: %s
fr: la fonction syslog doit correspondre à l'une des options suivantes : %s
pt_br: Recurso syslog deve ser um destes: %s

source: Fatal call to deprecated config: %(msg)s
fr: Appel fatal adressé à une configuration obsolète : %(msg)s
pt_br: Chamada fatal à configuração deprecada: %(msg)s

source: task run outlasted interval by %s sec
fr: exécution de la tâche supérieure à l'interval de %s seconde(s)
pt_br: Intervalo de execução de tarefa ultrapassou o intervalo por %s segundos

source: in fixed duration looping call
fr: dans l'appel en boucle de durée fixe
pt_br: em chamada de laço de duração fixa

source: Dynamic looping call sleeping for %.02f seconds
fr: La boucle dynamique passe en veille pour %.02f secondes
pt_br: Chama de laço dinâmico dormindo por %.02f segundos

source: in dynamic looping call
fr: dans l'appel en boucle dynamique
pt_br: Em chamada de laço dinâmico

source: Unexpected argument for periodic task creation: %(arg)s.
fr: Argument inattendu pour la création de tâche périodique : %(arg)s.
pt_br: Argumento inesperado para criação de tarefa periódica: %(arg)s.

source: Skipping periodic task %(task)s because its interval is negative
fr: Tâche périodique %(task)s ignorée car son intervalle est négatif
pt_br: Ignorando tarefa periódica %(task)s porque seu intervalo é negativo

source: Skipping periodic task %(task)s because it is disabled
fr: Tâche périodique %(task)s car elle est désactivée
pt_br: Ignorando tarefa periódica %(task)s porque ela está desativada

source: Running periodic task %(full_task_name)s
fr: Exécution de la tâche périodique %(full_task_name)s
pt_br: Executando tarefa periódica %(full_task_name)s

source: Error during %(full_task_name)s: %(e)s
fr: Erreur pendant %(full_task_name)s : %(e)s
pt_br: Erro durante %(full_task_name)s: %(e)s

source: Got unknown keyword args to utils.execute: %r
fr: Arguments de mot clé inconnus obtenus pour utils.execute : %r
pt_br: Obteve args de palavra-chave desconhecidos para utils.execute: %r

source: Running cmd (subprocess): %s
fr: Execution de la commande (sous-processus) : %s
pt_br: Executando comando (subprocesso): %s

source: Result was %s
fr: Le résultat était %s
pt_br: Resultado foi %s

source: %r failed. Retrying.
fr: Echec de %r. Nouvelle tentative.
pt_br: %r falhou. Tentando novamente.

source: Running cmd (SSH): %s
fr: Execution de la cmd (SSH): %s
pt_br: Executando o comando (SSH): %s

source: Environment not supported over SSH
fr: Environnement non pris en charge sur SSH
pt_br: Ambiente não suportado sobre SSH

source: process_input not supported over SSH
fr: process_input non pris en charge sur SSH
pt_br: process_input não suportado sobre SSH

source: Full set of CONF:
fr: Ensemble complet de CONF :
pt_br: Conjunto completo de CONF:

source: Caught %s, exiting
fr: %s interceptée, sortie
pt_br: Capturado %s, terminando

source: Exception during rpc cleanup.
fr: Exception pendant le nettoyage rpc.
pt_br: Exceção durante limpeza de RPC.

source: Parent process has died unexpectedly, exiting
fr: Processus parent arrêté de manière inattendue, sortie
pt_br: Processo pai morreu inesperadamente, terminando

source: Unhandled exception
fr: Exception non traitée
pt_br: Exceção não tratada

source: Forking too fast, sleeping
fr: Bifurcation trop rapide, pause
pt_br: Forks muito frequentes, dormindo

source: Started child %d
fr: Processus fils %d démarré
pt_br: Iniciado filho %d

source: Starting %d workers
fr: Démarrage de %d workers
pt_br: Iniciando %d workers

source: Child %(pid)d killed by signal %(sig)d
fr: Processus fils %(pid)d tué par le signal %(sig)d
pt_br: Filho %(pid)d morto pelo sinal %(sig)d

source: Child %(pid)s exited with status %(code)d
fr: Processus fils %(pid)s terminé avec le status %(code)d
pt_br: Filho %(pid)s terminado com status %(code)d

source: pid %d not in child list
fr: pid %d absent de la liste de processus fils
pt_br: pid %d não está na lista de filhos

source: Caught %s, stopping children
fr: Exception %s, arrêt des processus fils
pt_br: Capturado %s, parando filhos

source: Waiting on %d children to exit
fr: Attente arrêt des processus fils %d
pt_br: Aguardando filho %d para terminar

source: Unable to find cert_file : %s
fr: Impossible de trouver cert_file : %s
pt_br: Não é possível encontrar cert_file: %s

source: Unable to find ca_file : %s
fr: Impossible de trouver ca_file : %s
pt_br: Não é possível encontrar ca_file: %s

source: Unable to find key_file : %s
fr: Impossible de trouver key_file : %s
pt_br: Não é possível encontrar key_file: %s

source: When running server in SSL mode, you must specify both a cert_file and key_file option value in your configuration file
fr: Lors de l'exécution du serveur en mode SSL, vous devez spécifier une valeur d'option cert_file et key_file dans votre fichier de configuration
pt_br: Quando executando o servidor em modo SSL, você deve especificar um valor de opção cert_file e um key_file no seu arquivo de configuração

source: Invalid SSL version : %s
fr: Version de SSL invalide : %s
pt_br: versão SSL inválida: %s

source: cannot understand JSON
fr: impossible de comprendre JSON
pt_br: não é possível entender JSON

source: cannot understand XML
fr: impossible de comprendre XML
pt_br: não é possível entender o XML

source: An unknown error occurred in crypto utils.
fr: Une erreur inconnue s'est produite avec les outils crypto.
pt_br: Um erro desconhecido ocorreu em crypto utils.

source: Block size of %(given)d is too big, max = %(maximum)d
fr: La taille du block %(given)d est trop grande. max = %(maximum)d
pt_br: Tamanho do bloco de %(given)d é muito grande, máximo = %(maximum)d

source: Length of %(given)d is too long, max = %(maximum)d
fr: %(given)d est trop longue. max = %(maximum)d
pt_br: Comprimento de %(given)d é muito longo, máximo = %(maximum)d

source: Invalid Parameter: Unicode is not supported by the current database.
fr: Paramètre invalide: La base de donnée ne supporte pas Unicode.
pt_br: Parâmetro inválido: Unicode não é suportado pela base de dados atual.

source: version should be an integer
fr: version doit être un entier
pt_br: versão deve ser um inteiro

source: DB exception wrapped.
fr: Exception BD encapsulée.
pt_br: Exceção de base de dados incluída.

source: SQL connection failed. %s attempts left.
fr: Echec de connexion SQL. %s essais restants.
pt_br: Conexáo SQL falhou. %s tentativas restantes.

source: Sort key supplied was not valid.
fr: Clé de tri fournie invalide.
pt_br: Chave de ordenação fornecida não era válida.

source: Id not in sort_keys; is sort_keys unique?
fr: ID absent de sort_keys ; sort_keys unique ?
pt_br: ID não encontrado em sort_keys; é sort_keys único?

source: Unknown sort direction, must be 'desc' or 'asc'
fr: Sens de tri inconnu, doit être 'desc' ou 'asc'
pt_br: Direção de ordenação desconhecida, deve ser 'desc' ou 'asc'

source: Please specify column %s in col_name_col_instance param. It is required because column has unsupported type by sqlite).
fr: Spécifiez la colonne %s dans le paramètre col_name_col_instance. Ceci est obligatoire car la colonne a un type non pris en charge dans sqlite).
pt_br: Por favor especifique a coluna %s no parâmetro col_name_col_instance . Isto é requerido porque a coluna possui um tipo não suportado pelo sqlite).

source: col_name_col_instance param has wrong type of column instance for column %s It should be instance of sqlalchemy.Column.
fr: Le paramètre col_name_col_instance contient un type d'instance de colonne incorrect pour la colonne %s. Il devrait être une instance de sqlalchemy.Column.
pt_br: O parâmetro col_name_col_instance possui um tipo incorreto de instância de coluna para a coluna %s. Deve ser instância de sqlalchemy.Column.

source: Deleting duplicated row with id: %(id)s from table: %(table)s
fr: Suppression ligne en double avec l'ID : %(id)s de la table : %(table)s
pt_br: Excluindo linha duplicada com ID: %(id)s da tabela: %(table)s

source: Unsupported id columns type
fr: Type de colonnes id non pris en charge
pt_br: Tipo de ID de colunas não suportado
